{
  "_comment": "The following property defines the folder where the original mods ba2 files will be moved to, to be use by BMAT for the BA2 merges and separate from your mod manager and game folder so the game doesn't try to double load them. If empty BMAT will ask once during run and will store the value here.",
  "BA2MergingStagingFolder": "",
  "_comment": "If you have a faster disk where you want to do the BA2 files extract and re-archive use this property which defines the folder where the ba2 files will be extracted, cleaned up and re-archived. If this property is empty the temporary folders will be created under 'BA2MergingStagingFolder' folder. BMAT automatically cleans up after itself to keep the disk usage low. It is recommended to keep this folder on a separate disk with sufficient disk space. If empty BMAT will ask once during run and will store the value here.",
  "BA2MergingTempFolder": "",
  "_comment": "The following property defines the path to the loadorder.txt file. If empty BMAT will ask once during run and will store the value here.",
  "LoadOrderFilePath": "",
  "_comment": "The following property defines the game folder path. If empty BMAT will ask once during run and will store the value here.",
  "GameFolder": "",
  "_comment": "The following property defines the path to xEdit's BSArch.exe or BSArch64.exe. If empty BMAT will ask once during run and will store the value here.",
  "BSArchPath": "",
  "_comment": "The following property passes the game name to the script. Currently BMAT only supports Fallout4 game as BA2 files are used only by FO4 (don't use with Fallout London just yet).",
  "GameName": "fallout4",
  "_comment": "The following property defines the name of the new re-package mod name, the esp file name, and the ba2 file names.",
  "BA2MergedModName": "BMAT_BA2_Merge",
  "_comment": "The following property defines the which will be used by BMAT. 2 logs are always maintained by the script where one is current, and one is the previous log file.",
  "LogFileName": "bmat_ba2_merge",
  "_comment": "The following property defines the empty esl-flagged esp file supplied with BMAT which is later used to load the new ba2 files.",
  "EmptyESPFileName": "dummy-mod.esp",
  "_comment": "The following property defines the name of the csv file where BMAT will keep track of any processed mods and ba2 files. Once you start using BMAT deletion or manual modification of this file is not recommended.",
  "MergedFilesTrackerName": "bmat_merged-files-tracker.csv",
  "_comment": "The following property defines the name of the csv file where BMAT will look for ba2 files which should always be excluded from processing as those are the game core ba2 files and those don't count toward the ba2 used slots anyway.",
  "GameCoreFilesCsv": "games-core-ba2.csv",
  "_comment": "The following property defines the name of the csv file where BMAT will look for the core game plugin files.",
  "GameCorePluginsCsv": "games-core-plugins.csv",
  "_comment": "List files extensions where BMAT will check if any of those are found in the mod ba2 files and report on them to flag a dirty ba2 file.",
  "NonSupportedFilesFilter": "tga,psd,ini,exe,dll,yml",
  "_comment": "In case you want to suppress all logging then set this property to 'false'.",
  "DetailedLogging": "true",
  "_comment": "(This option is experimental and should be used with caution) If this property is set to true BMAT will try and detect if in the original BA2 files there are any folders which are in the wrong place and will move them where they should be. For example, if there are any Textures folders in the original Main type BA2 file those will be moved to a new Textures BA2 merge. If there are any Main type (like Main, Interface, Materials, Meshes, Scripts, Sound, Sounds, Voices, Animations, Music, Video) folders in the original Textures BA2 file, those will be moved to to a new Main BA2 merge. If the original BA2 files contain some other folders (my_mod_folder1\\main\\my_mod_folder2\\my_mod_file) which contain Main or Textures folders, those will be relocated where they should be.",
  "ModFolderRearange": "false"
}